:PROPERTIES:
:ID:       78e16841-d17f-45bd-a491-c1711423fdc1
:END:
#+title: :: cons operator
#+date: [2024-12-01 Sun 17:12]
#+startup: overview

* adding an element
#+begin_src ocaml
let u = [1; 2; 3; 4];;
9 :: u;;
#+end_src

#+RESULTS:
| 9 | 1 | 2 | 3 | 4 |
